## Header 
Auteur : Amina Matt  
Date de création : 27.12.2021  
Date de dernière modification: 27.12.2021   
Version : Python 3.8   
Description: Créer les objects d'une collection (books) en format  .md avec le format requis. Une boucle sur les objets pour remplir un tableau ([Datatable](https://www.datatables.net))

## Librairies

In [64]:
import pandas as pd

## Initialization

In [65]:
PATH = '../data/'
GENERATED_DATA = '../_books/'
CATALOG = PATH+'biblio_la_molene_catalogue.csv'

## Load

In [66]:
raw_data = pd.read_csv(CATALOG, encoding = 'utf8')

In [67]:
raw_data.head()

,NOM AUTEURICE,PRENOM AUTEURICE,& La pensée féministe au maghreb,EXEMPLAIRES,Unnamed: 4,Unnamed: 5
0,ABÉCASSIS,Eliette,9 Histoire Lumineuse ou le bien est le mal,16/24,NaN,NaN
1,ABIRACHED,Zeina,À cases égales - Des créatrices de BD romande...,42,NaN,NaN
2,ABIRACHED,Zeina,10 minutes et 38 secondes dans ce monde étrange,42,NaN,NaN
3,ABIRACHED\nENARD,Zeina\nMathias,100 Portraits contre l’état policier,42,NaN,NaN
4,ABOUET\nOUBRERIE,Marguerite\nClément,19 femmes,42,NaN,NaN

In [68]:
column_list = raw_data.columns
dataframe = raw_data.rename(columns={
    column_list[0]: 'Nom', 
    column_list[1]: 'Prenom',
    column_list[2]: 'Titre',
    column_list[3]: 'Categorie'})

dataframe.head()

,Nom,Prenom,Titre,Categorie,Unnamed: 4,Unnamed: 5
0,ABÉCASSIS,Eliette,9 Histoire Lumineuse ou le bien est le mal,16/24,NaN,NaN
1,ABIRACHED,Zeina,À cases égales - Des créatrices de BD romande...,42,NaN,NaN
2,ABIRACHED,Zeina,10 minutes et 38 secondes dans ce monde étrange,42,NaN,NaN
3,ABIRACHED\nENARD,Zeina\nMathias,100 Portraits contre l’état policier,42,NaN,NaN
4,ABOUET\nOUBRERIE,Marguerite\nClément,19 femmes,42,NaN,NaN

## Cleaning

In [69]:
dataframe = dataframe.drop(columns = [column_list[4],column_list[5]])

### None values

In [70]:
dataframe.iloc[23]

Nom                           AMNESTY INTERNATIONAL
Prenom                                          NaN
Titre        Ainsi furent-elles, Destins au féminin
Categorie                                        36
Name: 23, dtype: object

In [71]:
nan_value = float("NaN")
dataframe.replace( nan_value, "", inplace=True)

In [72]:
dataframe.iloc[23]

Nom                           AMNESTY INTERNATIONAL
Prenom
Titre        Ainsi furent-elles, Destins au féminin
Categorie                                        36
Name: 23, dtype: object

### Letters case

In [78]:
dataframe['Nom'] = dataframe['Nom'].apply(lambda x: x.lower())
dataframe['Nom'] = dataframe['Nom'].apply(lambda x: x.title())

dataframe['Prenom'] = dataframe['Prenom'].apply(lambda x: x.lower())
dataframe['Prenom'] = dataframe['Prenom'].apply(lambda x: x.title())



#dataframe['Prenom'] = dataframe['Prenom'].apply(lambda x: (x.str.lower().str.title()))
dataframe.head()

,Nom,Prenom,Titre,Categorie
0,Abécassis,Eliette,9 Histoire Lumineuse ou le bien est le mal,16/24
1,Abirached,Zeina,À cases égales - Des créatrices de BD romande...,42
2,Abirached,Zeina,10 minutes et 38 secondes dans ce monde étrange,42
3,Abirached\nEnard,Zeina\nMathias,100 Portraits contre l’état policier,42
4,Abouet\nOubrerie,Marguerite\nClément,19 femmes,42

## Writing

In [79]:
n = len(dataframe)

In [80]:
for i in range(n) :
    
    filename = str(i)+'.md'
    f = open(GENERATED_DATA+filename, "x", encoding='utf8')
     
    #row of interest 
    df = dataframe.iloc[i]
    
    # front matter markdown with
    f.write('---\n')
    f.write('Nom:  \''+df['Nom']+'\'\n')
    f.write('Prenom: \''+ df['Prenom']+'\'\n')
    f.write('Titre: \''+ df['Titre']+'\'\n')
    f.write('Categorie: \''+df['Categorie']+'\'\n')
    f.write('---')
    
    f.close()